NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/multiphase/compressibleInterFoam/laminar/climbingRod/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.liquid 0
);

regions
(
    boxToCell
    {
        box (0 0 -1) (1 0.0771 1);
        fieldValues
        (
            volScalarFieldValue alpha.liquid 1
        );
    }
);


// ************************************************************************* //
